{"24":"$","30":"0","13180":"New","10405153":"Boom Lifts","23735199":"Overview","24867101":"Third-party links on this site may direct you to third-party websites that are not affiliated with us. We are not responsible for examining or evaluating the content or accuracy and we do not warrant and will not have any liability or responsibility for any third-party materials or websites, or for any other materials, products, or services of third-parties. ","65040658":" carry all the necessary tools and diagnostic equipment to perform a wide range of maintenance and repair tasks on-site. This means less downtime for your business, as you won’t have to transport your equipment to a service centre. ","69486181":"Hiring Policy","77481619":"Buy 10","-7bff0f0":"2 Freedman St, North Geelong VIC 3215","-24f9f33e":"Open Mon - Fri 7am - 5pm","2103dce8":"sales@geelongaccesshire.com.au","202a0627":"03 4241 2463","6bdf2a12":"Servicing","-16d045dd":"Hire Operators","-23fa0704":"EWP Training","-4865fa92":"Equipment","8c37d3c":"Scissor & Vertical Lifts","-5c3ad14d":"Check out our wide range of Scissor & Vertical Lifts, perfect for every job and terrain","-5119dbfe":"View Range","aa13151":"Browse our extensive boom lift range with over 30 standard and specialised booms","-6171e685":"Trailer Booms","6a3e0581":"Trailer Booms (or Cherry Pickers) are nimble, easily transportable booms suitable for most jobs","-75ca508d":"View Trailer Boom","-1473f9d9":"Forklifts & Telehandlers","390fc870":"Hangcha Forklifts are world renowned for superior performance, economy and longevity.","-1503fa51":"Useful Links","645efc51":"About Us","-431bcdb2":"Find out more about Geelong Access Hire","-1c51ed57":"Credit Application","72578f57":"Apply for Credit with Geelong Access Hire","24fef3":"News","-6d801380":"Explore News","-64104400":"Contact","4af04940":"Link One","4af05d26":"Link Two","5046f1f8":"Link Three","1314cd8c":"Link Four","1314b718":"Link Five","4af057bc":"Link Six","50378c67":"Link Seven","4fea6cfa":"Training","-1f6710da":"Forklifts","5d6bcf8b":"View Forklifts","771411ec":"Brands","3d503d2b":"No items found.","-64202ba3":"Company","-501935d2":"Get In Touch","-177e2c38":"Free Quote","45e7299":"Legal","-3fbde6f6":"Privacy Policy","-3e157255":"Terms & Conditions","4dcea709":"Credit T&Cs","-2f879db5":"Stay In Touch","5a0ea5a1":"Thank you! Your submission has been received!","-7c112e99":"Oops! Something went wrong while submitting the form.","-204ff5b8":"Sign in","79cb582c":"Your Access Hire Experts","-599942ca":"Working Height","6d":"m","-3a1f27ca":"Max Capacity","d5c":"kg","-7106d690":"Can't Find It?","-12383a62":"Can't find what you're looking for? Give us a call to discuss your needs and we'll find a machine that is up for the job!","-32f93597":"Browse from over 175 Machines","-7424c2bc":"Scissor Lifts","-1e3fccee":"Need an operator?","-563d0565":" Hire qualified operators by the hour","52c32f8e":"Find Out More","-415bc239":"GEELONGS BEST RATES","-3ce75084":"Affordable + Quality ","284991fe":"Access Hire.","-1a4390b2":"Wide range of machines available","-871ccc1":"Delivery to Geelong + Surrounding Areas","-4e411008":"Free job analysis + recommendations","-6df203d4":"Locally owned and operated","1ea2daef":"Articulated straight and mass booms. Diesel, electric, hybrid and tracked.","4ff4999e":"Vertical Lifts","1d270073":"We also have a wide range of diesel and electric vertical lifts.","48c71fd3":"We have a wide range of diesel and electric scissor lifts available.","2d0f46a7":"Forklifts & Telehandlers","-1c8d2b09":"Superior Forklifts, Telehandlers and 2.5T Gas forklifts. ","2f":"/","cce":"ft","af86111":"Extensive ","7f8f21f1":"Expertise","-2beca400":"25+ Years Combined Experience in all things EWP","2b00b50b":"At Geelong Access Hire, our experienced team is ready to guide you through the selection process. Whether you need a boom lift for high-reach tasks, a scissor lift for narrow spaces, or a forklift for heavy lifting, we will assess your project requirements and recommend the most suitable machine. ","73135cfe":"Our personalised service ensures you get the right equipment for maximum efficiency and safety on the job site. ","3d1b69c":"Best ","-71049b96":"Prices","4224b79f":"Affordable EWP Hire Geelong","-3df9e1a3":"Our commitment to competitive pricing means you get top-quality machines without breaking the bank. We regularly review our rates to ensure they remain fair and accessible, making it easier for you to complete your projects on budget. ","-33b1e11c":"With our extensive range of boom lifts, scissor lifts, forklifts, and EWPs, you can be confident that you’re getting the best value for your money. ","-6c7008bc":"Short ","1eaf5c16":"& Long Term","-afd42b8":"However long you need, we can make it work!","16e03698":"Whether you need equipment for a day or a year, Geelong Access Hire can accommodate your access hire needs. Our flexible rental options are designed to fit the duration of your project, providing you with the right equipment for as long as you need it. ","3774d975":"From short-term rentals for immediate tasks to long-term solutions for ongoing projects, we’ve got you covered.","-5ae7364f":"Get A Free Quote","-6440f1e5":"Scissor Lifts | Vertical Lifts | Boom Lifts | Forklifts","1d92380d":"We'll help you pick the perfect machine for your job and help arrange delivery for it to wherever you are in Geelong or nearby!","16e8e12d":"Frequently Asked ","d37612d":"Questions","710c7c71":"What services does Geelong Access Hire offer?","-4a510679":"Geelong Access Hire provides a comprehensive range of access equipment rental services, including scissor lifts, boom lifts, cherry pickers, and forklifts. We cater to construction, maintenance, and various industrial projects, ensuring you have the right equipment to get the job done safely and efficiently. Our diverse fleet is designed to meet a variety of needs, from small-scale residential projects to large commercial developments. ","12855cf7":"For more information or to discuss your specific requirements, call us today or contact us for a free quote.","-6f6fe3a0":"How can I rent equipment from Geelong Access Hire?","-4f63d7f5":"Renting equipment from Geelong Access Hire is straightforward and convenient. ","6c404301":"You can start by browsing our extensive range of equipment on our website, where you’ll find detailed descriptions and specifications for each item. Once you’ve selected the equipment you need, simply request a quote online. Alternatively, you can call us directly at ","7cbc550c":" to speak with our knowledgeable staff who can help you choose the right equipment for your project and arrange a rental. ","163ae0af":"Don’t hesitate to contact us for a free quote and personalised service.","-197a8724":"What are the benefits of choosing Geelong Access Hire?","2653ce23":"Choosing Geelong Access Hire, a locally owned and operated business, ensures you receive high-quality, well-maintained equipment at competitive rates. Our expert team provides exceptional customer service, offering advice and support to help you select the right equipment for your project. We also provide prompt delivery and pickup services to keep your project on schedule. Additionally, our flexible rental options allow you to rent equipment for both short-term and long-term projects.","200d":"‍","-44ea74b3":"Call or email us today for a free, no obligation quote.","2f48c5d9":"What brands do you have?","-7968e65f":"Geelong Access Hire provides a wide range of high-quality equipment from reputable brands, including Dingli, Hangcha Forklifts, Skyjack, Genie, LGMG, Nifty, and more. Our diverse selection ensures you have access to reliable and efficient machinery for any project. We take pride in offering equipment that meets the highest standards of performance and safety. ","-5dcf88b4":"To learn more about our available brands and equipment, and to get a free quote for your rental needs, call us today or contact us online.","-7b21d370":"What areas do you serve?","479d3841":"Geelong Access Hire serves clients Victoria-wide, providing reliable access equipment rental solutions across the entire state. We are committed to supporting businesses and projects throughout Victoria with high-quality equipment and exceptional service.","-1b2efe07":"Our local knowledge and industry expertise allow us to deliver tailored services that meet the unique needs of our clients. If you’re anywhere in Victoria and need quality access equipment, call us or contact us for a free quote to discuss your project requirements.","2e2bdd94":"Can I rent equipment long-term?","20b77fb7":"Absolutely! Geelong Access Hire offers flexible rental options to suit both short-term and long-term projects. Whether you need equipment for a day, a week, or several months, we can accommodate your requirements with customised rental plans. ","-71be1ef7":"Our goal is to provide you with the right equipment for the duration of your project, ensuring maximum efficiency and cost-effectiveness. For more details on our rental options and to find the best plan for your project, call us or contact us for a free quote.","41c55248":"What should I do if the equipment breaks down?","-52b2f369":"If you experience any issues with the equipment during your rental period, contact Geelong Access Hire immediately. Our responsive support team will provide prompt assistance to troubleshoot and resolve the problem. If necessary, we will arrange for a replacement to minimise downtime and keep your project on track. ","4306fe3":"We are dedicated to ensuring your project runs smoothly, and our commitment to customer satisfaction means we are always here to help. For immediate support and to discuss any concerns, call us or contact us for a free quote.","7f2746de":"Contact Us","474adf30":"Get in touch with us using the form or details below. We look forward to hearing from you!","3ff5b7c":"Email","4984d4e":"Phone","1ed033d4":"Address","69b3163b":"First Name","-1416662b":"Last Name","-2b7010d0":"Email Address","-63dc6819":"Message","4bf84e39":"By submitting this form you agree to our ","329660ca":"privacy policy","7a04bf1b":"Dingli","418184c":"Genie","-737ad536":"Hangcha","47c71b0":"Nifty","23a055":"LGMG","4f912d2b":"Terms & Conditions","7fd6048e":"Site built by ","-7cf57e30":"Dab Hand Marketing","-104e22e5":"Showing ","3d90d7d6":" results","1ad29":"of ","5686788e":" items.","-289a734c":"highlight","-100574f0":"Reset All","46ac825":"Makes","5b":"[","5d":"]","-308726":"Capacity","-6245e0bc":"Fuel type","1477a":"Tag","-15752607":"Sort by","-110ef5f0":"Name (A/Z)","-36974c30":"Name (Z/A)","-799f8cab":"Lowest Height","1aa54063":"Highest Height","-5f52dc98":"Lowest Capacity","36f2e4f6":"Highest Capacity","-459669d3":"Newly added","-2803a28c":"Platform Height","-58f18a4d":"Geelong Access Hire","489d824":"Get in touch using the details below:","-4c82ad7e":"Apply For Credit","1299e579":"Credit Application T&Cs","22723e3b":"This website is operated by Geelong Access Hire. Throughout the site, the terms “we”, “us” and “our” refer to Geelong Access Hire. Geelong Access Hire offers this website, including all information, tools and services available from this site to you, the user, conditioned upon your acceptance of all terms, conditions, policies and notices stated here. ","57b5c452":"By visiting our site and/ or purchasing something from us, you engage in our “Service” and agree to be bound by the following terms and conditions (“Terms of Service”, “Terms”), including those additional terms and conditions and policies referenced herein and/or available by hyperlink. These Terms of Service apply to all users of the site, including without limitation users who are browsers, vendors, customers, merchants, and/ or contributors of content. ","6fb48e4f":"Please read these Terms of Service carefully before accessing or using our website. By accessing or using any part of the site, you agree to be bound by these Terms of Service. If you do not agree to all the terms and conditions of this agreement, then you may not access the website or use any services. If these Terms of Service are considered an offer, acceptance is expressly limited to these Terms of Service. ","64ff1213":"Any new features or tools which are added to the current store shall also be subject to the Terms of Service. You can review the most current version of the Terms of Service at any time on this page. We reserve the right to update, change or replace any part of these Terms of Service by posting updates and/or changes to our website. It is your responsibility to check this page periodically for changes. Your continued use of or access to the website following the posting of any changes constitutes acceptance of those changes. ","-1e2926db":"Our store is hosted by Dab Hand Marketing at dabhandmarketing.com. They provide us with the online e-commerce platform that allows us to sell our products and services to you. ","-1eb2f632":"Section 1 – Online Store Terms ","-4eb3a7c0":"By agreeing to these Terms of Service, you represent that you are at least the age of majority in your state or province of residence, or that you are the age of majority in your state or province of residence and you have given us your consent to allow any of your minor dependents to use this site. ","3fd3515a":"You may not use our products for any illegal or unauthorized purpose nor may you, in the use of the Service, violate any laws in your jurisdiction (including but not limited to copyright laws). ","-4b64ca74":"You must not transmit any worms or viruses or any code of a destructive nature. ","10cb6ec8":"A breach or violation of any of the Terms will result in an immediate termination of your Services. ","2a4f439a":"Section 2 – General Conditions ","3ea6396b":"We reserve the right to refuse service to anyone for any reason at any time. ","714c4ec7":"You understand that your content (not including credit card information), may be transferred unencrypted and involve (a) transmissions over various networks; and (b) changes to conform and adapt to technical requirements of connecting networks or devices. Credit card information is always encrypted during transfer over networks. ","-58366e07":"You agree not to reproduce, duplicate, copy, sell, resell or exploit any portion of the Service, use of the Service, or access to the Service or any contact on the website through which the service is provided, without express written permission by us. ","4ca32ddf":"The headings used in this agreement are included for convenience only and will not limit or otherwise affect these Terms. ","-48afe2a6":"Section 3 – Accuracy, Completeness & Timeliness of Information","-5df20571":"We are not responsible if information made available on this site is not accurate, complete or current. The material on this site is provided for general information only and should not be relied upon or used as the sole basis for making decisions without consulting primary, more accurate, more complete or more timely sources of information. Any reliance on the material on this site is at your own risk. ","7ca1a998":"This site may contain certain historical information. Historical information, necessarily, is not current and is provided for your reference only. We reserve the right to modify the contents of this site at any time, but we have no obligation to update any information on our site. You agree that it is your responsibility to monitor changes to our site. ","38105fab":"Section 4 – Modifications to the Service and Prices ","20b8f948":"Prices for our products are subject to change without notice. ","-407253e4":"We reserve the right at any time to modify or discontinue the Service (or any part or content thereof) without notice at any time. ","-6705ed7d":"We shall not be liable to you or to any third-party for any modification, price change, suspension or discontinuance of the Service.","221387bf":"Section 5 – Products or Services (if Applicable) ","-22f5f2be":"Certain products or services may be available exclusively online through the website. These products or services may have limited quantities and are subject to return or exchange only according to our Return Policy. ","49ee4888":"We have made every effort to display as accurately as possible the colors and images of our products that appear at the store. We cannot guarantee that your computer monitor’s display of any color will be accurate. ","450e89b8":"We reserve the right, but are not obligated, to limit the sales of our products or Services to any person, geographic region or jurisdiction. We may exercise this right on a case-by-case basis. We reserve the right to limit the quantities of any products or services that we offer. All descriptions of products or product pricing are subject to change at anytime without notice, at the sole discretion of us. We reserve the right to discontinue any product at any time. Any offer for any product or service made on this site is void where prohibited. ","45b56102":"We do not warrant that the quality of any products, services, information, or other material purchased or obtained by you will meet your expectations, or that any errors in the Service will be corrected. ","-be491b7":"Section 6 – Accuracy of Billing and Account Information ","-7bd3e523":"We reserve the right to refuse any order you place with us. We may, in our sole discretion, limit or cancel quantities purchased per person, per household or per order. These restrictions may include orders placed by or under the same customer account, the same credit card, and/or orders that use the same billing and/or shipping address. In the event that we make a change to or cancel an order, we may attempt to notify you by contacting the e‑mail and/or billing address/phone number provided at the time the order was made. We reserve the right to limit or prohibit orders that, in our sole judgment, appear to be placed by dealers, resellers or distributors. ","5e13db3":"You agree to provide current, complete and accurate purchase and account information for all purchases made at our store. You agree to promptly update your account and other information, including your email address and credit card numbers and expiration dates, so that we can complete your transactions and contact you as needed. ","22cb6be0":"For more detail, please review our Returns Policy.","6d2d0ed4":"Section 7 – Optional Tools ","-c89cc02":"We may provide you with access to third-party tools over which we neither monitor nor have any control nor input. ","6a2c2112":"You acknowledge and agree that we provide access to such tools ”as is” and “as available” without any warranties, representations or conditions of any kind and without any endorsement. We shall have no liability whatsoever arising from or relating to your use of optional third-party tools. ","-3fe6f2a4":"Any use by you of optional tools offered through the site is entirely at your own risk and discretion and you should ensure that you are familiar with and approve of the terms on which tools are provided by the relevant third-party provider(s). ","-2038c49c":"We may also, in the future, offer new services and/or features through the website (including, the release of new tools and resources). Such new features and/or services shall also be subject to these Terms of Service. ","5e57a8d7":"Section 8 – Third-Party Links ","-6ffdb0cb":"Certain content, products and services available via our Service may include materials from third-parties. ","-19f64256":"We are not liable for any harm or damages related to the purchase or use of goods, services, resources, content, or any other transactions made in connection with any third-party websites. Please review carefully the third-party’s policies and practices and make sure you understand them before you engage in any transaction. Complaints, claims, concerns, or questions regarding third-party products should be directed to the third-party. ","2aba59df":"Section 9 – User Comments, Feedback and Other Submissions ","-594027a8":"If, at our request, you send certain specific submissions (for example contest entries) or without a request from us you send creative ideas, suggestions, proposals, plans, or other materials, whether online, by email, by postal mail, or otherwise (collectively, ‘comments’), you agree that we may, at any time, without restriction, edit, copy, publish, distribute, translate and otherwise use in any medium any comments that you forward to us. We are and shall be under no obligation (1) to maintain any comments in confidence; (2) to pay compensation for any comments; or (3) to respond to any comments. ","-435185b6":"We may, but have no obligation to, monitor, edit or remove content that we determine in our sole discretion are unlawful, offensive, threatening, libelous, defamatory, pornographic, obscene or otherwise objectionable or violates any party’s intellectual property or these Terms of Service. ","4b291397":"You agree that your comments will not violate any right of any third-party, including copyright, trademark, privacy, personality or other personal or proprietary right. You further agree that your comments will not contain libelous or otherwise unlawful, abusive or obscene material, or contain any computer virus or other malware that could in any way affect the operation of the Service or any related website. You may not use a false e‑mail address, pretend to be someone other than yourself, or otherwise mislead us or third-parties as to the origin of any comments. You are solely responsible for any comments you make and their accuracy. We take no responsibility and assume no liability for any comments posted by you or any third-party. ","-7624541":"Section 10 – Personal Information","-545697b4":"Your submission of personal information through the store is governed by our Privacy Policy. To view our Privacy Policy. ","6d66d03a":"Section 11 – Errors, Inaccuracies and Omissions","-35dd6cf8":"Occasionally there may be information on our site or in the Service that contains typographical errors, inaccuracies or omissions that may relate to product descriptions, pricing, promotions, offers, product shipping charges, transit times and availability. We reserve the right to correct any errors, inaccuracies or omissions, and to change or update information or cancel orders if any information in the Service or on any related website is inaccurate at any time without prior notice (including after you have submitted your order). ","497b5646":"We undertake no obligation to update, amend or clarify information in the Service or on any related website, including without limitation, pricing information, except as required by law. No specified update or refresh date applied in the Service or on any related website, should be taken to indicate that all information in the Service or on any related website has been modified or updated. ","-37af7241":"Section 12 –Prohibited Uses","3393685d":"In addition to other prohibitions as set forth in the Terms of Service, you are prohibited from using the site or its content: (a) for any unlawful purpose; (b) to solicit others to perform or participate in any unlawful acts; (c) to violate any international, federal, provincial or state regulations, rules, laws, or local ordinances; (d) to infringe upon or violate our intellectual property rights or the intellectual property rights of others; (e) to harass, abuse, insult, harm, defame, slander, disparage, intimidate, or discriminate based on gender, sexual orientation, religion, ethnicity, race, age, national origin, or disability; (f) to submit false or misleading information; (g) to upload or transmit viruses or any other type of malicious code that will or may be used in any way that will affect the functionality or operation of the Service or of any related website, other websites, or the Internet; (h) to collect or track the personal information of others; (i) to spam, phish, pharm, pretext, spider, crawl, or scrape; (j) for any obscene or immoral purpose; or (k) to interfere with or circumvent the security features of the Service or any related website, other websites, or the Internet. We reserve the right to terminate your use of the Service or any related website for violating any of the prohibited uses. ","427a2729":"Section 13 – Disclaimer of Warranties; Limitation of Liability ","196161b4":"We do not guarantee, represent or warrant that your use of our service will be uninterrupted, timely, secure or error-free. ","-104728eb":"We do not warrant that the results that may be obtained from the use of the service will be accurate or reliable. ","6cf5eaf1":"You agree that from time to time we may remove the service for indefinite periods of time or cancel the service at any time, without notice to you. ","-77568248":"You expressly agree that your use of, or inability to use, the service is at your sole risk. The service and all products and services delivered to you through the service are (except as expressly stated by us) provided ‘as is’ and ‘as available’ for your use, without any representation, warranties or conditions of any kind, either express or implied, including all implied warranties or conditions of merchantability, merchantable quality, fitness for a particular purpose, durability, title, and non-infringement. ","433488d":"In no case shall Geelong Access Hire, our directors, officers, employees, affiliates, agents, contractors, interns, suppliers, service providers or licensors be liable for any injury, loss, claim, or any direct, indirect, incidental, punitive, special, or consequential damages of any kind, including, without limitation lost profits, lost revenue, lost savings, loss of data, replacement costs, or any similar damages, whether based in contract, tort (including negligence), strict liability or otherwise, arising from your use of any of the service or any products procured using the service, or for any other claim related in any way to your use of the service or any product, including, but not limited to, any errors or omissions in any content, or any loss or damage of any kind incurred as a result of the use of the service or any content (or product) posted, transmitted, or otherwise made available via the service, even if advised of their possibility. Because some states or jurisdictions do not allow the exclusion or the limitation of liability for consequential or incidental damages, in such states or jurisdictions, our liability shall be limited to the maximum extent permitted by law. ","307a8fd8":"Section 14 – Indemnification ","76eafb70":"You agree to indemnify, defend and hold harmless Geelong Access Hire and our parent, subsidiaries, affiliates, partners, officers, directors, agents, contractors, licensors, service providers, subcontractors, suppliers, interns and employees, harmless from any claim or demand, including reasonable attorneys’ fees, made by any third-party due to or arising out of your breach of these Terms of Service or the documents they incorporate by reference, or your violation of any law or the rights of a third-party. ","75fb33e7":"Section 15 – Severability","-19e925f2":"In the event that any provision of these Terms of Service is determined to be unlawful, void or unenforceable, such provision shall nonetheless be enforceable to the fullest extent permitted by applicable law, and the unenforceable portion shall be deemed to be severed from these Terms of Service, such determination shall not affect the validity and enforceability of any other remaining provisions. ","37e7bb69":"Section 16 – Termination ","-54381e61":"The obligations and liabilities of the parties incurred prior to the termination date shall survive the termination of this agreement for all purposes. ","-26ba86d5":"These Terms of Service are effective unless and until terminated by either you or us. You may terminate these Terms of Service at any time by notifying us that you no longer wish to use our Services, or when you cease using our site. ","68f316ba":"If in our sole judgment you fail, or we suspect that you have failed, to comply with any term or provision of these Terms of Service, we also may terminate this agreement at any time without notice and you will remain liable for all amounts due up to and including the date of termination; and/or accordingly may deny you access to our Services (or any part thereof). ","2e817739":"Section 17 – Entire Agreement ","-6682ac1":"The failure of us to exercise or enforce any right or provision of these Terms of Service shall not constitute a waiver of such right or provision. ","2f0727bc":"These Terms of Service and any policies or operating rules posted by us on this site or in respect to The Service constitutes the entire agreement and understanding between you and us and govern your use of the Service, superseding any prior or contemporaneous agreements, communications and proposals, whether oral or written, between you and us (including, but not limited to, any prior versions of the Terms of Service). ","e375732":"Any ambiguities in the interpretation of these Terms of Service shall not be construed against the drafting party. ","46ede63a":"Section 18 – Governing Law ","6e9f852c":"These Terms of Service and any separate agreements whereby we provide you Services shall be governed by and construed in accordance with the laws of United Kingdom. ","-629b4ea3":"Section 19 – Changes to Terms of Service ","27ad2571":"You can review the most current version of the Terms of Service at any time at this page. ","605010a0":"We reserve the right, at our sole discretion, to update, change or replace any part of these Terms of Service by posting updates and changes to our website. It is your responsibility to check our website periodically for changes. Your continued use of or access to our website or the Service following the posting of any changes to these Terms of Service constitutes acceptance of those changes. ","33175d28":"Section 20 – Contact Information ","-2a400a2c":"Questions about the Terms of Service should be sent to us at info@geelongaccesshire.com.","76f703a3":"Max Height","1697eeed":"Filtering by:","-644db21":"aVAILABLE noW","7bfce662":"Engine","-6e23cd80":"Download Specs","33a4abf0":"Specifications","-360d424":"Description","487b7361":"Horizontal Outreach","24e95fe5":"Risk Assessment PDF","-68fb8605":"Interested in hiring this machine? Get in touch with us using the details below:","121b82d2":"Products > Harness","65508a25":"$120/Each","710cbb2":"The Ultimate Safety","-5d240306":"Access Harness.","bb274b":"This entry fit, full body harness with Lanyard is the very best of safety equipment. When it comes to your access hire safety - this harness has you in safe hands.","3c2336d":"About","20c6c381":"The Harness","-3d831f6d":"Quick Release Buckles","185a587a":"The forged harnesses quick release buckles offer premium protection against falls and, unlike other harnesses, are easy and fast to disconnect when needed.","12e496de":"UV Resistant","-137d9006":"Harnesses which are regularly used outdoors are subject to UV deterioration. That's why our harness is fully UV Resistant.","-2bcc2c41":"Fully Adjustable","4d28995f":"Not only is adjustability important for comfort, it's paramount for safety. This harness is fully adjustable for the perfect fit.","a2b76ee":"Lightweight","4d0c616f":"This EWP harness is super lightweight because we know that wearing a heavy harness makes your life a million times harder.","-a6a1fb1":"Invest in your safety","37d80cc7":"Buy The Harness","71bb21fc":"Buy Now","19fbca58":"$120 + Shipping","7ececff0":"Save $100","1a0e068b":" when you buy 10+","149b178b":"Buy Heaps. Save Heaps.","ac790cf":"Get a discount when you buy in bulk. Use the pricing below to save. ","be10":"110","2c5b2b0":"/each","71babc83":"Buy 50x","bdf6":"105","7ecee711":"Save $750","-3a6505df":"Buy 100x","bdf1":"100","666dff5":"Save $2,000","-4e3b945a":"More Than 250?","d312106":"Holy Moly!","-27fff01c":"Contact for best price","7b01d550":"* Price Excludes GST + Shipping for Online Orders","-3637c06d":"Click below to download the latest copy of the Hire Agreement.","2e083c68":"Download here","-46638baf":"Message Sent","14ca8358":"Your message has been sent. Someone from our team will be in touch within 24 business hours with a response. ","10d7ee38":"Section 1 - Online Store Terms","-49c7e3a8":"A breach or violation of any of the Terms will result in an immediate termination of your Services.","4d014aec":"Section 2 - General Conditions","-1e8f619f":"The headings used in this agreement are included for convenience only and will not limit or otherwise affect these Terms.","-48e6450d":"Section 3 - Accuracy, Completeness & Timelines of Information","-424a097e":"Section 4 – Modification to the Service and Prices","-79b7c203":"We shall not be liable to you or to any third-party for any modification, price change, suspension or discontinuance of the Service. ","-2a1bab5f":"Section 5 – Products or Services (If Applicable)","32f3ef50":"We do not warrant that the quality of any products, services, information, or other material purchased or obtained by you will meet your expectations, or that any errors in the Service will be corrected","-10e65749":"Section 6 – Accuracy of Billing and Account Information","36a21040":"For more detail, please review our Returns Policy. ","5e5c4acc":"Section 7 – Optional Tools","30824c3c":"We may also, in the future, offer new services and/or features through the website (including, the release of new tools and resources). Such new features and/or services shall also be subject to these Terms of Service.","-7924c377":"Section 8 – Third-party Links","-723c0d9f":"Section 9 – User Comments, Feedback and Other Submissions","-554d1dac":"Your submission of personal information through the store is governed by our Privacy Policy. To view our Privacy Policy.","-6548745d":"Section 12 – Prohibited Uses ","1a701c23":"In addition to other prohibitions as set forth in the Terms of Service, you are prohibited from using the site or its content: (a) for any unlawful purpose; (b) to solicit others to perform or participate in any unlawful acts; (c) to violate any international, federal, provincial or state regulations, rules, laws, or local ordinances; (d) to infringe upon or violate our intellectual property rights or the intellectual property rights of others; (e) to harass, abuse, insult, harm, defame, slander, disparage, intimidate, or discriminate based on gender, sexual orientation, religion, ethnicity, race, age, national origin, or disability; (f) to submit false or misleading information; (g) to upload or transmit viruses or any other type of malicious code that will or may be used in any way that will affect the functionality or operation of the Service or of any related website, other websites, or the Internet; (h) to collect or track the personal information of others; (i) to spam, phish, pharm, pretext, spider, crawl, or scrape; (j) for any obscene or immoral purpose; or (k) to interfere with or circumvent the security features of the Service or any related website, other websites, or the Internet. We reserve the right to terminate your use of the Service or any related website for violating any of the prohibited uses.","-506fac29":"Section 13 – Disclaimer of Warranties; Limitation of Liability","496b4919":"Section 15 – Severability ","1415a974":"These Terms of Service and any separate agreements whereby we provide you Services shall be governed by and construed in accordance with the laws of United Kingdom.","-32e4cdd":"Section 19 – Changes to Terms of Service","ebb50c":"Request A Quote","2f09f63f":"Need an access hire quote that blows all the others out the water? Give us a call and we'll get you our best rate! ","-687c1ec":"Call Now","7e85e19e":"Search results","-75764c4":"No matching results.","-5845a3b8":"Terms & Condition","-3acbf76e":"Section 1 – Online Store Terms","15d6546":"Section 2 – General Conditions","-1959c061":"Section 5 – Products or Services (If Applicable) ","548c54b7":"Section 8 – Third-party Links ","1b199d41":"Section 10 – Personal Information ","3f733726":"Section 11 – Errors, Inaccuracies and Omissions ","46fc721a":"Section 18 – Governing law ","53a3aace":"Section 20 – Contract Information ","5137bd9a":"Questions about the Terms of Service should be sent to us at info@geelongaccesshire.com","-7c3fb0ff":"A tough, compact forklift with a two-wheel drive system. It is based on XF series IC forklift truck. It is world renowned for superior performance, economy and longevity.","-364f31f7":"Haudralic Side Shifts","557cad10":"Forklift Extensions Available","3a8374b0":"Lifting Height","5fca702b":"LPG / Gas","7a00d3fa":"Diesel","7635fb4f":"This is some text inside of a div block.","-62a157d":"The new efficiency lighting system employs LED illuminant and new type reflector to reduce energy consumption.","-6c3fa75e":"Optimized designing structure to offer agood visibility and easy entrance of thepallet","38482f39":"The new designed steering wheel\\ newbrake system and the easy-to-operatelevers provide total handling operation","-d78b7a3":"Features","-d192be6":"Reliability","35db2eb0":"Suspension hydraulic transmission with two forward gears and one reverse, providing higher speed and greater gradeability; Drive axle is equipped with wide-base and deep tread tires, enhanced brakes, bearings, differential with automatic locking function, as well as enhanced steering axle assembly providing ultimate traction during inclement weather conditions and rough operating surfaces.","217a5d06":"Comfortable","4e7e1122":"In developing the rough terrain forklift, comfort and easy operation is always considered, for example, improved vibrating levels, compound engine damper and full floating seat and cabin are all applied. ","7da0012d":"Comfortable also contribute to increased productivity and reduced the noise.","76589af3":"Maintenance","4d8e56b3":"The cover on the Panel can be lifted up simply to check the brake fluid.","46d224f2":"Productivity","76fe6854":"The new Dynamic load sensing hydraulic steering system contributes to reduce loss of hydraulic and improve energy efficiency.","-126477f7":"We're Sorry","1f0769a1":"This page is missing! You'll need to head back home.","2268ff":"Home","24eeab":"Name","-75f21995":"EWP & Machine","1e008615":"Servicing Geelong","-509d85c9":"Experienced Technicians You Can Rely On","1022d":"At ","-200b73cc":", our skilled technicians specialise in servicing ","-4e4d8133":"EWPs, forklifts, and telehandlers","-3400975d":" to keep your equipment running safely and efficiently. Whether it’s routine maintenance, inspections, or urgent repairs, we ensure your machinery meets compliance standards and performs at its best.","384d7c83":"Our personalised service keeps downtime to a minimum while extending the lifespan of your equipment.","-3a7f19be":"Keeping Your Equipment Safe & Job-Ready","-40e8f94a":"We offer ","-38acd707":"cost-effective servicing","-7bb9faae":" for all major brands of ","-551a869":"scissor lifts, boom lifts, forklifts, and telehandlers","50678b26":". Our ","-36430cb":"competitive pricing","891b9":" ensures you get expert maintenance and repairs at fair rates—helping you avoid costly breakdowns and keep your fleet in top condition.","51f3d6d5":"Regular servicing reduces the risk of unexpected failures and extends the life of your equipment.","53fdc597":"One-Off Servicing or Ongoing Maintenance","bda88bd":"Whether you need a ","3e274c11":"one-time repair, scheduled servicing, or a full maintenance plan","d419e00":", we tailor our services to suit your ","-2658806f":"equipment usage and workload","2e":".","40fed96":"From ","2e8951ee":"minor tune-ups","104ce5":" to ","-668128d8":"major overhauls","565e4b23":", our servicing options ensure your ","6ef6a0fb":" remain compliant, reliable, and ready for any job.","144f1d58":"Major Inspections","-78c6fb7e":"Revamping your machines with full major inspections to ensure safety, compliance, and peak performance across Geelong and surrounds!","4b16b9e8":"What types of equipment do you service?","-251f2eff":", we specialise in servicing a wide range of ","-22c4fcb0":"elevated work platforms (EWPs), scissor lifts, boom lifts, forklifts, and telehandlers","43d78e3c":" from all major brands. Whether you have a small electric scissor lift for indoor use or a large diesel boom lift for outdoor construction, our experienced technicians have the expertise to diagnose issues, perform regular maintenance, and carry out repairs efficiently. ","-2da3c79e":"Keeping your equipment well-maintained ensures compliance with safety regulations, extends the lifespan of your machines, and reduces the risk of costly downtime.","-2d9f27ca":"How often should my equipment be serviced?","7df62c2b":"The frequency of servicing depends on several factors, including ","25ea6643":"how often the equipment is used, the type of work it’s performing, and manufacturer recommendations","-437dbf9d":". As a general rule, ","4463058f":"EWPs and forklifts should be serviced every 3-6 months","57de99b0":" to ensure they remain compliant with Australian safety standards. ","64ac2d85":"Regular servicing helps identify potential issues before they turn into major problems, improving both safety and efficiency. We offer ","70563c2e":"custom maintenance plans","309b91f1":" tailored to your equipment’s usage patterns, ensuring it stays in peak working condition year-round. If you’re unsure how often your machinery should be serviced, our team can assess your needs and provide expert guidance.","-29161b24":"Do you provide emergency breakdown repairs?","-1b7e2dd9":"Yes! We understand that machinery breakdowns can cause serious delays to your operations, which is why we offer ","-69203548":"emergency breakdown repairs","3e6205be":" to get your ","12fb76b6":"EWP, forklift, or telehandler","30854b3e":" back up and running as quickly as possible. Our technicians can diagnose and fix most issues on-site, reducing downtime and getting your equipment back in action. ","-101323fd":"If a repair requires more extensive work, we can transport your machine to our workshop for a full service and ensure it is returned to you in optimal condition. Regular servicing can help prevent breakdowns, but if you ever experience an unexpected issue, our team is just a phone call away.","442b91d4":"Can you service my equipment on-site?","7cbbb6bb":"Yes, we offer ","-395523cc":"mobile servicing","-4933809f":" across ","-443925f7":"North Geelong and surrounding areas","-53d3a99e":", allowing us to inspect, maintain, and repair your machinery directly at your worksite. Our ","-4365e9e3":"fully equipped service vehicles","54be079d":"On-site servicing is ideal for businesses with large fleets or those who need their equipment to remain operational with minimal interruptions. We also offer scheduled servicing plans to ensure your machinery is always in top working order.","-54bc3ac0":"How much does servicing cost?","-6dd1009a":"The cost of servicing depends on factors such as ","-2ef73eba":"the type of equipment, the level of servicing required, and whether any replacement parts are needed","5b54021b":". We pride ourselves on offering ","-657740bf":" without compromising on quality. ","-34dfb366":"Our team will provide you with a ","-20981a30":"detailed quote before any work is carried out","-75eee246":", so you know exactly what to expect. Regular maintenance can save you money in the long run by preventing costly breakdowns and extending the life of your machinery. Whether you need a ","5695fe54":"one-off service or an ongoing maintenance plan","-3865dcdf":", we have flexible options to suit your budget and operational needs.","-6d5f519c":"How do I book a service?","-56491877":"Booking a service with ","-4ef6d33c":" is simple and hassle-free. You can call us at ","2d54cf94":" to speak with one of our friendly team members, who will help you schedule a service at a convenient time. Alternatively, you can fill out our ","26d27cd8":"online booking form","50d08748":", and we will get back to you promptly with availability. ","-1ab00d61":"quick inspection, a full maintenance service, or emergency repairs","24e9ce72":", our experienced technicians are ready to assist. Keeping your ","a1ec438":" in peak condition is crucial for workplace safety and efficiency, so don’t wait until an issue arises—book your service today!","843fd13":"2.5~3.5t Rough Terrain Forklifts","7964d82b":"Hangcha 2.5~3.5t rough terrain forklifts is a tough, compact forklift with a two-wheel drive system. It is based on XF series IC forklift truck. ","7717bd0b":"It is world renowned for superior performance, economy and longevity.","-574a1424":"Lift Height","-3a4f9735":"Downloads","7ce9c93b":"Download Risk Assessment","29acced3":"Labour Hire & Skilled Personnel Services","-6f16acd":"At Geelong Access, we also specialise in supplying ","30802de1":"reliable, qualified labour","6e0aad6a":" across a range of industries. Whether you need ","-23d00234":"short-term support","103a7d":" or ","-cee935b":"long-term staffing","-58703644":" solutions, we deliver experienced professionals ready to get the job done safely and efficiently.","-2e1cff93":"EWP Operators","-144f0dd4":"Our experienced Elevated Work Platform (EWP) operators are certified and ready to work at height with a strong focus on safety and compliance.","1d75538c":"Electrical Spotters","1dfc02c9":"Our fully ticketed electrical spotters are trained to work alongside plant operators, ensuring safety around electrical assets.","6ce76cb8":"Hire Machines","399b4329":"Need an EWP, Forklift or Telehandler? We have a wide range of machines available for every job. Contact us today to discuss your requirements.","-4fb66b16":"What access equipment is available in Melbourne?","10ad502":"At Geelong Access Hire, we offer a wide range of access equipment with experienced operators in Melbourne, including scissor lifts, boom lifts, vertical lifts, and knuckle booms. Our fleet, featuring trusted brands like JLG, Genie, and Skyjack, is ideal for construction, maintenance, and industrial projects. ","55b215ea":"Whether you need a diesel scissor lift for outdoor work or an electric boom lift for indoor tasks, our operators ensure safe and efficient operation tailored to your project needs.","4827c748":"Why hire an operator in Melbourne?","-47a3802":"Hiring an operator with access equipment from Geelong Access Hire ensures safety, efficiency, and compliance with Australian workplace standards. Our operators are accredited members of the Elevating Work Platform Association and have over 30 years of industry experience. They handle complex tasks, navigate challenging sites, and operate equipment like the JLG 4394RT Diesel Scissor Lift, saving you time and reducing risks on your Melbourne project.","-47095f7e":"How much is operator hire in Melbourne?","-34b87011":"The cost to hire an access equipment operator in Melbourne depends on the equipment type, rental duration, and project requirements. ","-555c3821":"At Geelong Access Hire, we offer competitive rates, with flexible options for short-term or long-term hires. For example, our JLG 4394RT Diesel Scissor Lift with an operator is priced to suit various budgets. Contact us at (03) 4241 2463 for a free, no-obligation quote tailored to your Melbourne site.","df4b917":"Is same-day hire available in Melbourne?","-31ef03e5":"Yes, Geelong Access Hire offers same-day delivery for access equipment and operators across Melbourne and surrounding areas, including Geelong. If your project faces urgent needs or unexpected delays, our team can quickly deploy equipment like boom lifts or scissor lifts with skilled operators to keep your work on schedule. Call us to discuss your requirements and arrange prompt service.","1d31984e":"Are operators safety-trained in Melbourne?","3885e192":"Absolutely. All operators at Geelong Access Hire are fully trained, accredited, and comply with Australian safety standards, including those set by the Elevating Work Platform Association. With over 30 years of industry expertise, our operators ensure safe handling of equipment like vertical lifts and knuckle booms, minimising risks on Melbourne construction, maintenance, or industrial sites.","-ecc5626":"How to book an operator in Melbourne?","-6ae9e21":"Booking an access equipment operator with Geelong Access Hire is simple. Call our friendly team at (03) 4241 2463 or email us to discuss your project needs. We’ll recommend the right equipment, such as a boom lift or scissor lift, and pair it with a skilled operator. We provide free advice and quotes, ensuring you get the best solution for your Melbourne worksite, with flexible rental terms and prompt delivery.","5942655e":"Yellow Card Training","3bddb85f":"Gain the skills and certification to safely operate Elevated Work Platforms (EWPs) with Geelong Access Hire’s EWPA Yellow Card training.","3029f3a":" You'll be able to operate:","65cbd591":"Boom Lift <11m","3e51650f":"Scissor Lift","218bca":"From","11232c":"$330","-29ec4eb6":"Compleded in","2c2170d":"1 Day","-715b651":"Get Your Ticket","78dd18e2":"Same Day","-5b970c7e":"Get Your EWPA Yellow Card","-59f4df69":"Our one-day course blends hands-on practice with critical safety training, perfect for beginners or experienced operators. ","538b2178":"Get certified to work confidently and compliantly across Australian job sites with Geelong Access Hire.","-46535578":"What Can You Operate?","6ede7ac4":"Boom Lift (Up to 11m)","165875ca":"Operate boom lifts up to 11m in height with the EWPA Yellow card. For boom lifts over 11m, you will need another licence.","-5d7d0122":"Scissor Lift (Unrestricted)","355dd78":"Use any scissor lift with no restriction in height. Our trainers will show you how to competently operate this machinery.","382eb5b8":"Vertical Lift (Unrestricted)","-7e344dc3":"Much like the scissor lift, the EWPA Yellow Card will allow you to operate any scissor lift with no restriction in height.","6fdcdb7":"Why Train With Us?","-19b681d9":"What is an EWPA Yellow Card?","-250307cb":"The EWPA Yellow Card, issued by the Elevating Work Platform Association of Australia, is a nationally recognised certification that verifies your ability to operate Elevated Work Platforms (EWPs) safely and competently. Specifically, it qualifies you to operate boom lifts up to 11 metres (self-propelled or trailer-mounted), scissor lifts (all heights), and vertical lifts (all heights). ","-6fb612df":"Our training adheres to AS 2550.10 standards, covering pre-operational checks, hazard identification, safe manoeuvring, and emergency procedures. This certification is essential for workers in construction, warehousing, and maintenance, ensuring compliance with Safe Work Australia regulations and enhancing workplace safety.","ab8c977":"Who is eligible for EWP training?","-b8d9f71":"Our EWP training is open to individuals aged 16 or older with basic English proficiency for understanding safety instructions and assessments. No prior EWP experience is required, making it accessible to beginners, while experienced operators can formalise their skills with certification. ","-5eb97f0e":"The course includes practical exercises and written assessments, with trainers offering support to ensure all participants, including those in construction and industrial sectors, achieve competency in operating boom lifts, scissor lifts, and vertical lifts safely.","-3c2eae26":"What EWPs can I operate with the Yellow Card?","-450673f0":"The EWPA Yellow Card, earned through our training, authorises you to operate boom lifts up to 11 metres (including self-propelled and trailer-mounted models), scissor lifts of any height, and vertical lifts of any height. ","cb14e2b":"This covers equipment commonly used on construction sites, warehouses, and maintenance projects, such as Genie GS-1932 scissor lifts or JLG 340AJ boom lifts. The training ensures you can perform tasks like platform positioning, load management, and safe navigation, meeting industry standards across Australia.","5d079eb4":"How long does the training take?","-5d8310bc":"Our EWPA Yellow Card course is typically completed in one day (approximately 6-8 hours), combining theoretical instruction with practical training. The programme covers critical topics like EWP safety systems, risk assessments, and operational techniques, with hands-on practice using boom lifts, scissor lifts, and vertical lifts. ","-4898241f":"Flexible scheduling, including weekday and weekend options, accommodates workers and businesses, with group bookings available for companies training multiple staff members efficiently.","c514780":"Is the EWPA Yellow Card valid across Australia?","3c4dc8c0":"Yes, the EWPA Yellow Card, obtained through our programme, is recognised across all Australian states and territories. It meets the requirements of Safe Work Australia and is accepted by employers in industries such as construction, facilities management, and warehousing.","14b5d52d":"This portability ensures you can work confidently on diverse job sites, with the certification serving as proof of your ability to operate EWPs safely and in compliance with national standards."}